githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
  /* Data class interface descriptor */
  0x09,                                       /* bLength: Endpoint Descriptor size */
  USB_DESC_TYPE_INTERFACE,                    /* bDescriptorType: */
  0x01,                                       /* bInterfaceNumber: Number of Interface */
  0x00,                                       /* bAlternateSetting: Alternate setting */
  0x02,                                       /* bNumEndpoints: Two endpoints used */
  0x0A,                                       /* bInterfaceClass: CDC */
  0x00,                                       /* bInterfaceSubClass */
  0x00,                                       /* bInterfaceProtocol */
  0x00,                                       /* iInterface */

  /* Endpoint OUT Descriptor */
  0x07,                                       /* bLength: Endpoint Descriptor size */
  USB_DESC_TYPE_ENDPOINT,                     /* bDescriptorType: Endpoint */
  CDC_OUT_EP,                                 /* bEndpointAddress */
  0x02,                                       /* bmAttributes: Bulk */
  LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),        /* wMaxPacketSize */
  HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
  0x00,                                       /* bInterval */

  /* Endpoint IN Descriptor */
  0x07,                                       /* bLength: Endpoint Descriptor size */
  USB_DESC_TYPE_ENDPOINT,                     /* bDescriptorType: Endpoint */
  CDC_IN_EP,                                  /* bEndpointAddress */
  0x02,                                       /* bmAttributes: Bulk */
  LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),        /* wMaxPacketSize */
  HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
  0x00                                        /* bInterval */
};
#endif //if CDC




//request from host --> should be use a struct
uint8_t bmRequestType;
uint8_t bRequest;
uint16_t wValue;
uint16_t wIndex;
uint16_t wLength;


uint32_t epReceivedData[12] = {0};

volatile uint8_t totalLengthEp0In = 0;
volatile uint8_t totalLengthEp0Out = 0;
volatile uint8_t remainLengthEp0In = 0;
volatile uint8_t remainLengthEp0Out = 0;


uint8_t xferInLen = 0;
uint8_t xferOutLen = 0;

uint8_t *xferBuffIn = NULL;
uint8_t *xferBuffOut = NULL;


uint32_t data[CDC_DATA_FS_OUT_PACKET_SIZE/4]={0}; //for word alignment
uint8_t cmdLength;
uint8_t cmdOpCode;  //.stack


uint8_t setAddressSuccess = 0;

uint8_t UserTxBuff[Tx_BUFFER_SIZE];
uint8_t UserRxBuff[Rx_BUFFER_SIZE];

////volatile void *Descriptor = NULL;  //using volatile to update Descriptor in interrupt context
void *Descriptor = NULL;  //using volatile to update Descriptor in interrupt context
						  //using int or using pointer to function for multi desc

//for debug
#define LIMIT 20
#define LIMIT_1 21
uint8_t indexCheckOderRun = 0;
uint8_t checkOderRun[20] = {0};
uint8_t startStoreOder = 0;

//////

//uint32_t dataFromHost[20] = {0};

struct epStatus
{
	uint8_t In;
	uint8_t Out;
	uint8_t Stall;
	uint8_t Type;
	uint8_t State;
};

struct epStatus epStt = 
{
	.In = 0,   //"." mean init not follow order of struct member, in this case it's yes/no is still ok
	.Out = 0,
	.Stall = 0,
	.Type = 0,
	.State = 0,
};



void pinConfig(void)
{
	//DP PA12, DM PA11
	//enable GPIOA registers
	uint32_t *pRCC_AHB1ENR = (uint32_t*)(RCC_BASE_ADDR + 0x30);
	*pRCC_AHB1ENR |= (1 << GPIOAEN__RCC_AHB1ENR);

	//MODE: alter function mode
	uint32_t *pGPIOA__GPIOx_MODER = (uint32_t*)(GPIOA_BASE_ADDR + 0x00);
	*pGPIOA__GPIOx_MODER &= ~(3 << MODER11);
	*pGPIOA__GPIOx_MODER |= (2 << MODER11);
	*pGPIOA__GPIOx_MODER &= ~(3 << MODER12);
	*pGPIOA__GPIOx_MODER |= (2 << MODER12);

	//otyper push-pull
	uint32_t *pGPIOA__GPIOx_OTYPER = (uint32_t*)(GPIOA_BASE_ADDR + 0x04);
//	*pGPIOA__GPIOx_OTYPER &= ~(1 << OT09);
//	*pGPIOA__GPIOx_OTYPER &= ~(1 << OT10);
	*pGPIOA__GPIOx_OTYPER &= ~(1 << OT11);
	*pGPIOA__GPIOx_OTYPER &= ~(1 << OT12);

	//speed: high speed
	uint32_t *pGPIOA__GPIOx_OSPEEDR = (uint32_t*)(GPIOA_BASE_ADDR + 0x08);
	*pGPIOA__GPIOx_OSPEEDR &= ~(3 << OSPEEDR11);
	*pGPIOA__GPIOx_OSPEEDR |= (3 << OSPEEDR11);
	*pGPIOA__GPIOx_OSPEEDR &= ~(3 << OSPEEDR12);
	*pGPIOA__GPIOx_OSPEEDR |= (3 << OSPEEDR12);

	//pull-up/down: no
	uint32_t *pGPIOA__GPIOx_PUPDR = (uint32_t*)(GPIOA_BASE_ADDR + 0x0C);
	*pGPIOA__GPIOx_PUPDR &= ~(3 << PUPDR11);
	*pGPIOA__GPIOx_PUPDR &= ~(3 << PUPDR12);

	//assign OTG_FS function
	uint32_t *pGPIOA__GPIOx_AFRH = (uint32_t*)(GPIOA_BASE_ADDR + 0x24);
	*pGPIOA__GPIOx_AFRH &= ~(0x0f << AFRH11);
	*pGPIOA__GPIOx_AFRH |= (0x0A << AFRH11);
	*pGPIOA__GPIOx_AFRH &= ~(0x0f << AFRH12);
	*pGPIOA__GPIOx_AFRH |= (0x0A << AFRH12);
}


uint8_t resetCore(void)
{
	//wait for AHB master enter idle state
	__IO uint32_t count = 0U;
	do
	{
		count++;
		HAL_Delay(1U);
		if(count > 20000U)
		{
			return AHB_IDEL_FAIL;
		}
	}while(((*pOTG_FS_GRSTCTL) & 0x80000000) == 0U); //AHBIDL bit is 0 <=> AHB master is running

	*pOTG_FS_GRSTCTL |= (1 << 0); //reset core

	count = 0;
	do
	{
		count++;
		HAL_Delay(1U);
		if(count > 20000U)
		{
			return SOFT_RESET_FAIL;
		}
	}while(((*pOTG_FS_GRSTCTL) & 0x1) == 1U); //AHBIDL bit is 0 <=> AHB master is running
	
	return SOFT_RESET_OK;

}


uint8_t setMode(uint8_t mode)
{
	*pOTG_FS_GUSBCFG &= ~((1 << FDMOD)|(1 << FHMOD));
	*pOTG_FS_GUSBCFG |= (1 << mode);
	HAL_Delay(50);
	if((*pOTG_FS_GINTSTS & 0x1) != (!(mode - 29))) //0: Device, 1: Host
	{
		return SET_MODE_FAIL;
	}
	return SET_MODE_OK;

}

uint8_t setSpeed(uint8_t speed)
{
	//stm32f411 is only support "full speed" mode
	if(speed != 3)
	{
		return 1; //fail
	}
	
	*pOTG_FS_DCFG &= ~(3 << DSPD);
	*pOTG_FS_DCFG |= (speed << DSPD);
	
	return 0; //ok
}


uint8_t devInit(void)
{
	//setup Vbus sens (this will active pullup resistor)
	*pOTG_FS_DCTL |= (1 << SDIS); //disable pull up resistor
	*pOTG_FS_GCCFG |= (1 << NOVBUSSENS);
	*pOTG_FS_GCCFG &= ~(1 << VBUSBSEN);
	*pOTG_FS_GCCFG &= ~(1 << VBUSASEN);

	//reset PHY clock
	*pOTG_FS_PCGCCTL &= ~(0x1F); 

	//set device speed
	if(setSpeed(3) != 0)
	{
		return 1; //set speed fail
	}

	//flush fifo

	//clear all device previous interupt mask setting 
	*pOTG_FS_DIEPMSK &= 0x00;
	*pOTG_FS_DOEPMSK &= 0x00;
	*pOTG_FS_DAINTMSK &= 0x00;
	
	//global interrupt
	*pOTG_FS_GINTMSK &= 0x00;
	*pOTG_FS_GINTSTS &= 0xBFFFFFFF; //except SRQINT

	//set up interrupt
	//enable receive fifo non-empty interrupt, when dma is disable
	*pOTG_FS_GINTMSK |= (1 << RXFLVLM); //unmask

	//enable interrupt for device mode only 
	*pOTG_FS_GINTMSK |= ((1 << USBSUSPM) | (1 << USBRST) | (1 << ENUMDNEM) \
	| (1 << OEPINT) | (1 << IEPINT) | (1 << IISOIXFRM) | (1 << IPXFRM_DEVICE_MOD) \
	| (1 << WUIM));


