githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
	//enble sof (for i2s or isoch mode) -> disable in device mode
	// *pOTG_FS_GINTMSK |= (1 << SOFM);

	//enable vbus sense (recommend for switch mode) -> disable in device mode
	// *pOTG_FS_GINTMSK |= ((1 << SRQIM) | (1 << OTGINT));

	return 0; //OK
}

void setRxSizeFifo(uint8_t size)
{
	*pOTG_FS_GRXFSIZ &= 0x0000;
	*pOTG_FS_GRXFSIZ |= size;
}
void setTxSizeFifo(uint8_t numTx, uint8_t size)
{
	uint16_t TxOffset = *pOTG_FS_GRXFSIZ; //get size of Rx due to struct of FIFO
										 //see user manual (FIFO architecture)
	//set for Tx0
	if(numTx == 0)
	{
	*pOTG_FS_HNPTXFSIZ__DIEPTXF0 &= 0x00;
	*pOTG_FS_HNPTXFSIZ__DIEPTXF0 |= ((uint16_t)size << NPTXFD__TX0FD | TxOffset);
	}
	else
	{
		TxOffset += *pOTG_FS_HNPTXFSIZ__DIEPTXF0 >> 16; //size of Tx0
		int i = 0;
		for(i = 0; i < (numTx - 1U); i++)
		{
			TxOffset += (*(pOTG_FS_DIEPTXF1_3 + 0x04*i)) >> 16; //get size of Txx
		}
		*(pOTG_FS_DIEPTXF1_3 + 0x04*i) = (uint16_t)size << 16 | TxOffset;
	}

}


void startDev(void)
{
	//enable global interrupt
	*pOTG_FS_GAHBCFG |= (1 << GINTMSK_);

	//ensure clock gating is open
	*pOTG_FS_PCGCCTL &= ~((1 << STPPCLK) | (1 << GATEHCLK));

	//start connecting
	*pOTG_FS_DCTL &= ~(1 << SDIS);

}





void USB_ReadPacket(uint8_t *pData, uint8_t length)
{
	//read 8 byte, it is request device description package from host

	uint8_t count32Byte = (uint32_t)length >> 2;  //alignment, may be use >> 2
	uint8_t remainByte = length % 4; //maybe use len - count32Byte* 4 (depend on instruction is generated)

	if(remainByte != 0)
	{
		count32Byte += 1;
	}

	for(int i = 0; i < count32Byte; i++)
	{
		((T32*)(void*)pData)->v = *(uint32_t*)(OTG_FS_BASE_ADDR + OTG_FIFO_BASE);
		pData += 4;
		//__UNALIGNED_UINT32_WRITE(epReceivedData, *(uint32_t*)(OTG_FS_BASE_ADDR + OTG_FIFO_BASE));
	}

#ifdef SHIFT_PDATA
	pData -= (4 - remainByte);
#endif

	//__UNALIGNED_UINT32_WRITE

}

uint8_t DeviceDescriptor[18];
void *getFSDeviceDescriptor(uint8_t *lenDes)
{
	*lenDes = sizeof(DeviceDescriptor);
	return (void*)DeviceDescriptor;
}

void *getFsConfigurationDesc(uint8_t *lenDes)
{
	*lenDes = sizeof(USBD_CDC_CfgDesc);
	return (void*)USBD_CDC_CfgDesc;
}

uint8_t ep0SendData(uint8_t *pBuff, uint8_t epAddr, uint8_t lengthData)
{

	if(epStt.In == 1)
	{

		if(lengthData == 0)
		{
			*pOTG_FS_DIEPTSIZ0 &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DIEPTSIZ0 &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DIEPTSIZ0 |= ((0x3FF << PKTCNT) & (1 << PKTCNT));
		}

		if(lengthData > MAX_PACKET_SIZE_EP0)
		{
			lengthData = MAX_PACKET_SIZE_EP0;
		}
		if(lengthData != 0)
		{


			*pOTG_FS_DIEPTSIZ0 &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DIEPTSIZ0 &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DIEPTSIZ0 |= ((0x3FF << PKTCNT) & (1 << PKTCNT));

			*pOTG_FS_DIEPTSIZ0 |= (lengthData << XFRSIZ);
		}


		//enable EP (start transmit)
		*pOTG_FS_DIEPCTL(0) |= ((1 << CNAK) | (1 << EPENA)); //respond DATA is send  (show packet in wireshark)

		//enable Tx empty fifo interrupt
		if(lengthData > 0)
		{
			//for enum 0
			*pOTG_FS_DIEPEMPMSK |= (1 << 0);
		}
		
		//update remaining data length
		xferInLen = lengthData; 
	}
	else
	{
		if(lengthData > 0) //due to if it have data need to transfer, ep will sent 64byte for each transfer 
		{
			lengthData = MAX_PACKET_SIZE_EP0;
		}
		//if(lenRequired != 0)
		//{
			*pOTG_FS_DOEPTSIZ0 &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DOEPTSIZ0 &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DOEPTSIZ0 |= ((0x3FF << PKTCNT) & (1 << PKTCNT));

			*pOTG_FS_DOEPTSIZ0 |= (lengthData << XFRSIZ);
			
			//enable EP (start transmit)
			*pOTG_FS_DOEPCTL(0) |= ((1 << CNAK) | (1 << EPENA));

		//}

		xferOutLen = lengthData;
	}

	return 0;
}



uint8_t epXSendData(uint8_t* pBuff, uint8_t epAddr,  uint8_t lengthData)
{
	if(epStt.In == 1)
	{

		if(lengthData == 0)
		{
			*pOTG_FS_DIEPTSIZ(epAddr & 0x0f) &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DIEPTSIZ(epAddr & 0x0f) &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DIEPTSIZ(epAddr & 0x0f) |= ((0x3FF << PKTCNT) & (1 << PKTCNT));
		}
		if(lengthData > MAX_PACKET_SIZE_EPx)
		{
			lengthData = MAX_PACKET_SIZE_EPx;
		}
		if(lengthData != 0)
		{

			*pOTG_FS_DIEPTSIZ(epAddr & 0x0f) &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DIEPTSIZ(epAddr & 0x0f) &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DIEPTSIZ(epAddr & 0x0f) |= ((0x3FF << PKTCNT) & (1 << PKTCNT));
			*pOTG_FS_DIEPTSIZ(epAddr & 0x0f) |= (lengthData << XFRSIZ);
		}


		//enable EP (start transmit)
		*pOTG_FS_DIEPCTL(epAddr & 0x0f) |= ((1 << CNAK) | (1 << EPENA)); //respond DATA is send  (show packet in wireshark)

		//enable Tx empty fifo interrupt
		if(lengthData > 0)
		{
			//for enum 0
			*pOTG_FS_DIEPEMPMSK |= (1 << 0);
		}
		
		//update remaining data length
		xferInLen = lengthData; 
	}
	else
	{
		if(lengthData > MAX_PACKET_SIZE_EPx)
		{
			lengthData = MAX_PACKET_SIZE_EPx;
		}
		//if(requiredLength != 0)
		//{
			*pOTG_FS_DOEPTSIZ(epAddr & 0x0f) &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DOEPTSIZ(epAddr & 0x0f) &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DOEPTSIZ(epAddr & 0x0f) |= ((0x3FF << PKTCNT) & (1 << PKTCNT));
			*pOTG_FS_DOEPTSIZ(epAddr & 0x0f) |= (lengthData << XFRSIZ);

			//enable EP (start transmit)
			*pOTG_FS_DOEPCTL(epAddr & 0x0f) |= ((1 << CNAK) | (1 << EPENA));

		//}

		xferOutLen = lengthData;
	}

	return 0;
}



void setAddressEp(void)
{
	if((wLength == 0) && (wIndex == 0) && (wValue < 128))
	{
		*pOTG_FS_DCFG &= ~(0x7f << DAD);
		*pOTG_FS_DCFG |= (wValue << DAD);
	}
	setAddressSuccess = 1;

}




#if 1 //move to new file

void usbdActivateEndpoint(uint8_t epNum, uint8_t epType, uint8_t epMaxPacketSize)
{
	if(epStt.In == 1)
	{
		//unmask interrupt for partical end point
		*pOTG_FS_DAINTMSK |= ((0xffff << 0) & (1 << epNum)); //equivalant 2 command: clear previous value, assign new value
		if((*pOTG_FS_DIEPCTL(epNum) >> EPENA) == 0x01) //due to EPENA is 31th bit -> no need to & 0x01
		{
			*pOTG_FS_DIEPCTL(epNum) |= ((epMaxPacketSize << MPSIZ__OTG_FS_DIEPCTL0) | (epType << 18) | (epNum << 22)\
			| (1 << SD0PID_SEVNFRM) | (1 << USBAEP));
		}
	}	
	else
	{
		//unmask interrupt for partical end point
		*pOTG_FS_DAINTMSK |= ((0xffff << 16) & ((1 << epNum) << 16)); //equivalant 2 command: clear previous value, assign new value
		if((*pOTG_FS_DOEPCTL(epNum) >> EPENA) == 0x01) //due to EPENA is 31th bit -> no need to & 0x01
		{
			*pOTG_FS_DOEPCTL(epNum) |= ((epMaxPacketSize << MPSIZ__OTG_FS_DIEPCTL0) | (epType << 18) | (epNum << 22)\
			| (1 << SD0PID_SEVNFRM) | (1 << USBAEP));
		}
	}
}

void openEp(uint8_t epAddress, uint8_t epType, uint8_t epMaxPacketSize)
{
	if((epAddress & 0x80) == 0x80)
	{
		epStt.In = 1;
	}
	else
	{
		epStt.In = 0;
	}
	
	// temp no need
	//ep->num = ep_addr & EP_ADDR_MSK;
	//ep->maxpacket = ep_mps;
	//ep->type = ep_type;

	if(epStt.In != 0)
	{
		//set txfifo
		//ep->tx_fifo_num = ep->num;
	}
	
