githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
	// init data PID
	if(epType == 2) //bulk type
	{
		//ep->data_pid_start = 0U;
	}

	//epNum = epAddress & 0x0f;
	usbdActivateEndpoint((epAddress & 0x0f), epType, epMaxPacketSize);

}


void usbdOpenEp(uint8_t epAddress, uint8_t epType, uint8_t epMaxPacketSize)
{
	openEp(epAddress, epType, epMaxPacketSize);
}



void usbEpSetStall(uint8_t epNum)
{
	if(epStt.In == 1)
	{
		if((((*pOTG_FS_DIEPCTL(epNum) >> 31) & 0x01) == 0) && (epNum != 0)) //need to modify for all CTL register
		{
			*pOTG_FS_DIEPCTL(epNum) |= ~(1 << 30); //this line will clear EPDIS bit (rs bit), mean EPDIS interrupt will be trigger
		}
		*pOTG_FS_DIEPCTL(epNum) |= (1 << STALL);
	}
	else
	{
		if((((*pOTG_FS_DOEPCTL(epNum) >> 31) & 0x01) == 0) && (epNum != 0)) //need to modify for all CTL register
		{
			*pOTG_FS_DOEPCTL(epNum) |= ~(1 << 30); //this line will clear EPDIS bit (rs bit), mean EPDIS interrupt will be trigger
		}
		*pOTG_FS_DOEPCTL(epNum) |= (1 << STALL);
	}
}



void ep0OutStart(void)
{
	//need modify for all DOEPTSIZ register
	
	//if(USB_OTG_CORE_ID_300A)
	//{
	//
	//}


	*pOTG_FS_DOEPTSIZ0 = 0U;
	*pOTG_FS_DOEPTSIZ0 |= (1 << PKTCNT);
	*pOTG_FS_DOEPTSIZ0 |= (3 * 8);
	*pOTG_FS_DOEPTSIZ0 |= (3 << STUPCNT);
	
	//if(dma == 1)
	//{
	//
	//}
}


void stallEp(uint8_t epAddress)
{
	if((epAddress & 0x80) == 0x80)
	{
		epStt.In = 1;
		//epNum =
	}
	else
	{
		epStt.Out = 1;
		//epNum = 
	}
	epStt.Stall = 1;

	usbEpSetStall(epAddress & 0x0f);

	if((epAddress & 0x0f) == 0)
	{
		ep0OutStart(); //reset DOEPTSIZ register
	}
}




#endif //if 0 move to new file


/*usbSend and usbReceive , both are use ep0SendData and epXSendData*/

//this func will rise a DIEP_TXFC interrupt(overall: send data to host will rise this interrupt)
void usbSend(uint8_t* pBuff, uint8_t epAddr, uint8_t lenData)
{
	////epNum != epAddr

	epStt.State = USBD_EP0_DATA_IN;
	epStt.In = 1;
	
	if((epAddr & 0x0f) == 0)
	{
		ep0SendData(pBuff, epAddr, lenData);

	}
	else
	{
		if(epStt.Type == EP_TYPE_ISOC) // = 0x01
		{	
			epXSendData(pBuff, epAddr, lenData);//pBuff due to it contain writePacket func for ISOC type 
		}
		else
		{
			
			epXSendData(pBuff, epAddr, lenData); 
		}
	}
}


void usbReceive(uint8_t *pBuff, uint8_t epAddr, uint8_t lenData) //re-check this func, check how to pBuff is passed
{
	
	xferBuffOut = pBuff;


	epStt.In = 0;	
	if((epAddr & 0x0f) == 0)
	{
		ep0SendData(pBuff, epAddr, lenData);  //<==> EP0StartXfer in HAL library
	}
	else
	{
		if(epStt.Type == EP_TYPE_ISOC) // == 0x01	
		{
			epXSendData(pBuff, epAddr, lenData);
		}
		else
		{
			epXSendData(pBuff, epAddr, lenData);
		}
	}
	
}


void usbSendStatus(uint8_t* pBuff, uint8_t epAddr, uint8_t lenData)
{
	usbSend(pBuff, epAddr, lenData);
}


void usbSendData(uint8_t *pBuff, uint8_t epAddr, uint8_t lenData)
{
	usbSend(pBuff, epAddr, remainLengthEp0In);
}

void usbSendError(void)
{
	//set stall bit in IN/OUT endpoint
	stallEp(0x80);//in ep
	stallEp(0x00);//out ep
}

void usbdCdcClassInit(uint8_t speed)
{
	if(speed == 0) //usb high speed
	{
		//add some code for this device type
	}
	else if(speed == 3) //usb full speed
	
	{
		//open IN, OUT ep
		//usbdOpenEp(addressm type, size);
		usbdOpenEp(CDC_IN_EP_ADDR, USBD_EP_TYPE_BULK, CDC_DATA_FS_IN_PACKET_SIZE);
		
		//change state of ep 1: is used (no need in tthis period)
		//

		usbdOpenEp(CDC_OUT_EP_ADDR, USBD_EP_TYPE_BULK, CDC_DATA_FS_OUT_PACKET_SIZE);
		
	}

	//open CDC_CMD EP
	usbdOpenEp(CDC_CMD_EP, USBD_EP_TYPE_INTR, CDC_CMD_PACKET_SIZE);
	//change state of ep 2: is used (no need in tthis period),
	//

	//init physical interface components (skipped in low level programing)

	//prepair receive next packet
	if(speed == 0)
	{
		//setting for high speed device
	}
	else if(speed == 3)
	{
		usbReceive((uint8_t*)Rx_BUFFER_SIZE, CDC_OUT_EP_ADDR, CDC_DATA_FS_OUT_PACKET_SIZE);
	}

}


uint8_t checkInterruptAfterSetConfig = 0;

void usbdSetClass(uint8_t speed) //parse type usb class
{
	usbdCdcClassInit(speed);
	checkInterruptAfterSetConfig = 1;
}


void usbdSetConfig(uint16_t configNum, uint8_t speed)
{
	//should check set address is success or not!!!!!
	if(configNum != 0)
	{
		usbdSetClass(speed); //class:cdc or msc or dfu ... and speed param
		usbSendStatus(NULL, 0x00, 0); //this func will rise a DIEP_TXFC interrupt(overall: send data to host will rise this interrupt)
	}
}

uint16_t min(uint16_t len1, uint16_t len2)
{
	return (len1 < len2 ? len1 : len2);
}


uint8_t checkProblem = 0;

void stdDev(void)
{
	uint8_t lenDesc = 0;
	uint8_t speedEnumDone = (*pOTG_FS_DSTS >> ENUMSPD) & 0x03;		

	switch (bRequest)
	{
	case 5:
		setAddressEp();
		usbSendStatus(NULL, 0x00, 0);
		break;

	case 6:
		switch(wValue >> 8)
		{
			case 0x01: //get device descriptor

				Descriptor = (void*)getFSDeviceDescriptor(&lenDesc);

				remainLengthEp0In = (uint8_t)min(lenDesc, wLength);
				totalLengthEp0In = lenDesc;
				
				usbSendData(NULL, 0x80, lenDesc);
				break;

			case 0x02: //get config

				//we must create function to change maxpacketsize between HS and FS, check HAL code
				//but now we can skip it due to value default in config des is for FS

				//attention due to size of config desc is larger 64 byte
				
				Descriptor = (void*)getFsConfigurationDesc(&lenDesc);
				remainLengthEp0In = (uint8_t)min(lenDesc, wLength);
				totalLengthEp0In = lenDesc;

				usbSendData(NULL, 0x80, lenDesc);
				break;

			case 0x06: //get device_qualifer (for device support both HS and FS speed)
				if(speedEnumDone == 0x00) //High speed
				{
					//do some things
				}
				else if(speedEnumDone == 0x03) //full speed
				{
					usbSendStatus(NULL, 0x80, 0); //no send data to avoid waiting from host.
				}
				break;

			default:
				break;
		}

		break;

	case 0x09: //set config
		usbdSetConfig(wValue, speedEnumDone);
		break;
	default:
		break;
	}
}




uint8_t usbdCoreFindIF(uint8_t requireIndex)
{
#ifdef USBD_USED_COMPOSITE
	//We do not use usb composite in this case so, do nothing in this #preprocess
	
#else

	return 0;

#endif
}



uint8_t usbdCoreFindEP(uint8_t requireIndex)
{
#ifdef USBD_USED_COMPOSITE
	//We do not use usb composite in this case so, do nothing in this #preprocess
	
#else

