githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
	return 0;

#endif
}



void cdcClassControl(uint8_t cmdOpCode, uint8_t* pBuff, uint8_t length)
{
switch(cmdOpCode)
	{
	case CDC_SEND_ENCAPSULATED_COMMAND:

		break;

	case CDC_GET_ENCAPSULATED_RESPONSE:

		break;

	case CDC_SET_COMM_FEATURE:

		break;

	case CDC_GET_COMM_FEATURE:

		break;

	case CDC_CLEAR_COMM_FEATURE:

		break;

	/*******************************************************************************/
	/* Line Coding Structure                                                       */
	/*-----------------------------------------------------------------------------*/
	/* Offset | Field       | Size | Value  | Description                          */
	/* 0      | dwDTERate   |   4  | Number |Data terminal rate, in bits per second*/
	/* 4      | bCharFormat |   1  | Number | Stop bits                            */
	/*                                        0 - 1 Stop bit                       */
	/*                                        1 - 1.5 Stop bits                    */
	/*                                        2 - 2 Stop bits                      */
	/* 5      | bParityType |  1   | Number | Parity                               */
	/*                                        0 - None                             */
	/*                                        1 - Odd                              */
	/*                                        2 - Even                             */
	/*                                        3 - Mark                             */
	/*                                        4 - Space                            */
	/* 6      | bDataBits  |   1   | Number Data bits (5, 6, 7, 8 or 16).          */
	/*******************************************************************************/
	case CDC_SET_LINE_CODING:

		break;

	case CDC_GET_LINE_CODING:

		break;

	case CDC_SET_CONTROL_LINE_STATE:

		break;

	case CDC_SEND_BREAK:

		break;

	default:
		break;
	}	
}


void usbdPrepairRx(uint32_t *pBuff, uint8_t len)
{
	epStt.State = USBD_EP0_DATA_OUT;
	totalLengthEp0Out = len;
	remainLengthEp0Out = len; //if USBD_AVOID_PACKET_SPLIT_MPS is not used
	usbReceive((uint8_t*)pBuff, 0, len);  //pBuff is used for DMA, or ISO mode
}

void cdcClassSetup(void)
{

	uint8_t len;
	switch(bmRequestType & bm_REQUEST_TYPE_MASK)
	{
		case bm_REQUEST_TYPE_CLASS:
			if((bmRequestType & 0x80) == (DEVICE_TO_HOST)) //prepair for send or receive data from host, in this case is received data
			{
				cdcClassControl(cmdOpCode, (uint8_t*)data, cmdLength);
				
				len = min(CDC_REQ_MAX_DATA_SIZE, wLength);
				usbSendData((uint8_t*)data, 0x80, len); //endpoint 0?????
			}
			else
			{
				cmdOpCode = bRequest;
				cmdLength = (uint8_t)min(wLength, MAX_PACKET_SIZE_EP0);
				
				//prepairRx
				usbdPrepairRx(data, cmdLength);
			}
			break;

		case bm_REQUEST_TYPE_STANDARD:
			break;

		default:
			usbSendError();
			break;
	}
}




void stdIF(void)
{

	uint8_t indexInterface = 0;
	switch(bmRequestType & bm_REQUEST_TYPE_MASK)
	{
		case bm_REQUEST_TYPE_STANDARD:
		case bm_REQUEST_TYPE_CLASS:
		case bm_REQUEST_TYPE_VENDOR:
			if(setAddressSuccess)
			{
				if((wIndex & 0xff) <= USBD_MAX_NUM_INTERFACES)  // <  1
				{

#ifdef USBD_USED_COMPOSITE	
indexInterface = usbdCoreFindIF(wIndex); //due to not use USBD_USED_COMPOSITE so indexInterface = 0;
#endif			
			
					if((indexInterface != 0xff) && (indexInterface < USBD_MAX_SUPPORTED_CLASS))
					{
						//setup for CDC class
						cdcClassSetup();
					
					}
					if(wLength == 0)
					{
						usbSendStatus(NULL, 0, 0); //send status
					}
				}
				else
				{
					//send error for both IN and OUT endpoint
					usbSendError();
					
				}
			}

			break;

		default:
			break;
	}	
		
}


void extractSetupPacket(uint32_t *pSetup)
{
	bmRequestType = pSetup[0] & 0xff;
	bRequest = (pSetup[0] >> 8) & 0xff;
	wIndex = pSetup[1] & 0xFFFF;
	wValue = pSetup[0] >> 16;
	wLength = pSetup[1] >> 16;

	//if(bmRequestType == 0x80)//get phase transfer direction
	//{

		//switch ((bmRequestType >> 5) & 0x03) //get Type
		//{
		//case 0:
			switch(bmRequestType & 0x1f)     //get Recepient
			{
			case 0:
				stdDev();
				break;
			case 1:
				stdIF();
				break;
			default:
				break;
			}
		//	break;
		//default:
		//	break;

		//}
	//}
	//else
	//{
		////temptly do nothing
	//}
}



void writePacket(uint8_t *dataSrc, uint8_t len)
{
	uint8_t count32 = (len + 3) / 4 ; //+3 'cause of len = 5, 9... bytes
	uint8_t *pSrc = dataSrc;
	for(int i = 0; i < count32; i++)
	{
		*(uint32_t*)(OTG_FS_BASE_ADDR + OTG_FIFO_BASE) = __UNALIGNED_32_READ_DATA(pSrc);
		pSrc++;
		pSrc++;
		pSrc++;
		pSrc++;
	}
}


static void  writeEmpFifo(uint8_t **data, uint8_t len)
{
	uint8_t lenLocal = 0;
	uint8_t len32 = 0;
	uint8_t count = 0;

	lenLocal = len - count;

	if(lenLocal > MAX_PACKET_SIZE_EP0)
	{
		lenLocal = MAX_PACKET_SIZE_EP0; //64 is max packet size, this value should be read from register, this line is aim for testing
	}

	len32 = (lenLocal + 3) / 4U;
	//check available space in fifo (unit in word)
	while((*pOTG_FS_DTXFSTS >= len32) && (len != 0U) && (count < len)) //this line must be modify later
	{
		lenLocal = len - count;
		if(lenLocal > MAX_PACKET_SIZE_EP0)
		{
			lenLocal = MAX_PACKET_SIZE_EP0;
		}

		len32 = (len + 3) / 4U;
		writePacket(*data, len); //

		(*data) += lenLocal; //descTrans += lenLocal
		count += lenLocal;
	}

	// remove tx empty fifo intererrupt flag for end point 0
	if(lenLocal <= count)
	{
		*pOTG_FS_DIEPEMPMSK &= ~(1 << 0);
	}
	
	return; 	
}



//void prepairReceive()
//{
//
//}


uint8_t timeWrite = 0;


void dataInStageCallback(void)///need to add epNum param
{
	
	if(1)//if enum == 0, change if condition for overall
	{
		if(1) //check status: USBD_EP0_DATA_IN, please complete the code for the overview
		{

			if(remainLengthEp0In > MAX_PACKET_SIZE_EP0)
			{
				remainLengthEp0In -= MAX_PACKET_SIZE_EP0;
				usbSendData(NULL, 0x80, remainLengthEp0In);
				usbReceive(NULL, 0x80, 0);
			}
			else
			{
				stallEp(0x80);
				usbReceive(NULL, 0x80, 0);
			}
		}
	}
}



void ep0Ready(void)
{
	//cmdOpCode = 0xFF;
	if(cmdOpCode != 0xFF)
	{
		cdcClassControl(cmdOpCode, (uint8_t*)data, cmdLength);
		cmdOpCode = 0xFF;
	}
}


void usbdContinousRx(uint8_t*pBuff, uint8_t length)
{

