githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
}

void dataOutStage(uint8_t* pBuff, uint8_t epNum)
{
	uint8_t index = 0;
	if(epNum == 0)
	{
		if(epStt.State == USBD_EP0_DATA_OUT)
		{
			if(remainLengthEp0Out > MAX_PACKET_SIZE_EP0)
			{
				remainLengthEp0Out -= MAX_PACKET_SIZE_EP0;
				usbdContinousRx(pBuff, min(remainLengthEp0Out, MAX_PACKET_SIZE_EP0));
			}
			else
			{
				//Find class relative current request
				switch(bmRequestType & 0x1F)
				{
					case REQUEST_RECEPIENT_DEVICE:
						index = 0;
						break;

					case REQUEST_RECEPIENT_INTERFACE:
						index = usbdCoreFindIF(wIndex);					
						break;

					case REQUEST_RECEPIENT_ENDPOINT:
						index = usbdCoreFindEP(wIndex);					
						break;
					
					default:
						index = 0;
				}

				if(index <= USBD_MAX_SUPPORTED_CLASS)
				{
					if(1) //check cocnfigured state?
					{
						//if(cmdOpCode != 0xFF)
						ep0Ready();//set cmdOpCode == 0xff	
					}
					
					//send status
					usbSendStatus(NULL, 0, 0);
				}
			}
		}
	}
	else
	{
		//temporary for planting (tam thoi de trong)
	}
}

void epOutComplete(uint8_t epNum)
{
	//if(dma == 1)
	//{
	//
	//}
	
	if((epNum == 0) && (xferOutLen == 0))  //consider ep 0 and 1 using same xferOutLen
	{
		ep0OutStart();
	}

	// in setup phase this function can be ignored
	//but when SET LINE CODING it be will active due to ep_state change to USBD_EP0_DATA_OUT
	
	dataOutStage((uint8_t*)epReceivedData, epNum);
}



void suspendCallback(void)
{
	//if(lowPowerEnable)
	//{
	//
	//}
	*pOTG_FS_PCGCCTL |= (1 << STPPCLK); //stop PHY clock source
	*pOTG_FS_GINTSTS |= (1 << USBSUSP); //clear usususp interrupt flag 
}


void resetUSBSignal(void)
{
	//disable remote wakeup signal
	*pOTG_FS_DCTL &= ~(1 << RWUSIG);

	//init 4 end point (f411 has 4 end point)
	for(int i = 0; i < 4; i++)
	{
		//clear status of interrupt
		*pOTG_FS_DIEPINT(i) = 0xFB7F;
		*pOTG_FS_DOEPINT(i) = 0xFB7F;

		//clear STALL signal
		*pOTG_FS_DIEPCTL(i) &= ~(1 << STALL);
		*pOTG_FS_DOEPCTL(i) &= ~(1 << STALL);

		//enable SNAK for OUT end point
		*pOTG_FS_DOEPCTL(i) |= (1 << SNAK);
	}

	//enable interrupt for end point IN 0//OUT 0
	*pOTG_FS_DAINTMSK |= ((1 << INEPM0) | (1 << OUTEPM0));

	//set interrupt when using endpoint 1 (this is skipped temporary)
	*pOTG_FS_DIEPMSK |= ((1 << TOM) | (1 << XFRCM) | (1 << EPDM));
	*pOTG_FS_DOEPMSK |= ((1 << NAKM) | (1 << STSPHSRXM) | (1 << STUPM) \
	| (1 << XFRCM) | (1 << EPDM));
	
	//set address (address = 0)
	*pOTG_FS_DCFG &= ~(1 << DAD);	

	//setup EP0 for first time receive setup packet
	ep0OutStart();

}


void usbActiveSetup(void)
{
	//set maxpacket size
	*pOTG_FS_DIEPCTL(0) &= ~(1 << MPSIZ__OTG_FS_DIEPCTLx); //00 mean maxpacket size ==  64 bytes (maximum)

	//clear global IN NAK CGINAK bit in DCTL (w bit)
	*pOTG_FS_DCTL |= (1 << CGINAK);

}

uint8_t usbGetSpeed(void)
{
	uint8_t speed;
	if(((*pOTG_FS_DSTS >> 1) & 0x03) == 3) //OTG_FS
	{
		speed = 2; 
	}
	else if(((*pOTG_FS_DSTS >> 1) & 0x03) == 0) //OTG_HS
	{
		speed  = 0;
	}
	else
	{
		speed = 0x0f;
	}
	
	return speed;

}

void usbSetTRDTValue(uint8_t hclk, uint8_t speed)
{
	uint8_t usbTrd;
	if(speed == 2) //OTG_FS
	{
		if ((hclk >= 14200000U) && (hclk < 15000000U))
		{
		  /* hclk Clock Range between 14.2-15 MHz */
		  usbTrd = 0xFU;
		}
		else if ((hclk >= 15000000U) && (hclk < 16000000U))
		{
		  /* hclk Clock Range between 15-16 MHz */
		  usbTrd = 0xEU;
		}
		else if ((hclk >= 16000000U) && (hclk < 17200000U))
		{
		  /* hclk Clock Range between 16-17.2 MHz */
		  usbTrd = 0xDU;
		}
		else if ((hclk >= 17200000U) && (hclk < 18500000U))
		{
			//hclk Clock Range between 17.2-18.5 MHz
			usbTrd = 0xCU;
		}
		else if ((hclk >= 18500000U) && (hclk < 20000000U))
		{
		  /* hclk Clock Range between 18.5-20 MHz */
		  usbTrd = 0xBU;
		}
		else if ((hclk >= 20000000U) && (hclk < 21800000U))
		{
			//hclk Clock Range between 20-21.8 MHz
			usbTrd = 0xAU;
		}
		else if ((hclk >= 21800000U) && (hclk < 24000000U))
		{
		  /* hclk Clock Range between 21.8-24 MHz */
		  usbTrd = 0x9U;
		}
		else if ((hclk >= 24000000U) && (hclk < 27700000U))
		{
		  /* hclk Clock Range between 24-27.7 MHz */
		  usbTrd = 0x8U;
		}
		else if ((hclk >= 27700000U) && (hclk < 32000000U))
		{
		  /* hclk Clock Range between 27.7-32 MHz */
		  usbTrd = 0x7U;
		}
		else /* if(hclk >= 32000000) */
		{
		  /* hclk Clock Range between 32-200 MHz */
		  usbTrd = 0x6U;
		}	
	}
	else if(speed == 0) //OTG_FS
	{
		usbTrd = 9;
	}
	else  //default case
	{
		usbTrd = 9;
	}

	//clear value
	*pOTG_FS_GUSBCFG &= ~(0x0f << TRDT);  //4 bit 10 -> 13
	*pOTG_FS_GUSBCFG |= (usbTrd << TRDT);

}

//void enumSetSpeed(void)
//{
//
//}



void enumReset(void)
{
	//#ifdef USE_USBD_COMPOSITE
	//#endif

	//for OUT EP
	usbdOpenEp(0x00, 2, 64); //2: bulk type
	
	//pdev->ep_out[0x00U & 0xFU].is_used = 1U;
	//pdev->ep_out[0].maxpacket = USB_MAX_EP0_SIZE;
	
	//for IN EP
	usbdOpenEp(0x80, 2, 64);
	
	//pdev->ep_out[0x00U & 0xFU].is_used = 1U;
	//pdev->ep_out[0].maxpacket = USB_MAX_EP0_SIZE;
}


void enumdoneResetCallback(void)
{
	//set speed, this func is used in qualify config
	//enumSetSpeed(); // program based on register isn't consider temply
	
	//reset
	enumReset();
}


uint16_t readOutEpIntrStatus(uint8_t epNum)
{
	return (uint16_t)(*pOTG_FS_DOEPINT(epNum) & *pOTG_FS_DOEPMSK);
}

uint16_t readInEpIntrStatus(uint8_t epNum)
{
	//get TXFE bit for DIEPINT, use tmp due to 7th bit always = 0, if use register it will never change
	uint32_t tmp = *pOTG_FS_DIEPMSK | (((*pOTG_FS_DIEPEMPMSK >> epNum) & 0x01) << TXFE); 	
	return (uint16_t)(tmp &= *pOTG_FS_DIEPINT(epNum));
}


void usbInterruptHandler(void)
{

// handler for usb suspend, reset enumdone, read, get descriptor, transfer data into FIFO, IN done, OUT done


	uint32_t matchedGlobalIntr = ((*pOTG_FS_GINTSTS) & (*pOTG_FS_GINTMSK));

	//check mismatch interrupt
	if(((matchedGlobalIntr >> MMIS) & 1) == 1)
	{
		//clear mismode interrupt bit
		*pOTG_FS_GINTSTS |= (1 << MMIS);
		return;
	}


	//receive data from host
	if(((matchedGlobalIntr >> RXFLVL) & 1) == 1)
	{


		uint32_t popRegister = *pOTG_FS_GRXSTSP;
		//read GRXSTP check kind of received data is data package or setup package
		*pOTG_FS_GINTMSK &= ~(1 << RXFLVLM);
		if(((popRegister >> PKTSTS) & 7) == 0x02)
		{
			if(startStoreOder > 0)
						{
							checkOderRun[indexCheckOderRun] = 15;
							indexCheckOderRun ++;
							if(indexCheckOderRun >= LIMIT)
							{
								indexCheckOderRun = LIMIT_1;
							}
						}

			uint8_t byteCount = (popRegister >> BCNT) & 0x7FF;
			if(byteCount != 0)
			{
				USB_ReadPacket((uint8_t*)epReceivedData, byteCount);
			}
		}

