githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
		else if(((popRegister >> PKTSTS) & 7) == SETUP_PKG_RECEIVED) //if use *pOTG_FS_GRXSTSR in here,
																	 //data will be one byte right shifted
																	 //not in 0x00 address anymore
		{


			USB_ReadPacket((uint8_t*)epReceivedData, 8);
			
			//if((epReceivedData[0] ==  0x02000680) && (epReceivedData[1] == 0x430000))
			if((epReceivedData[0] ==  0x2021))
			{
				startStoreOder = 1;
			}

			if(startStoreOder > 0)
			{
				checkOderRun[indexCheckOderRun] = 1;
				indexCheckOderRun ++;
				if(indexCheckOderRun >= LIMIT)
				{
					indexCheckOderRun = LIMIT_1;
				}
			}

		}

		//clear receive data interrupt bit

		*pOTG_FS_GINTMSK |= (1 << RXFLVLM);
	}


////	*pOTG_FS_GINTMSK |= ((1 << USBSUSPM) | (1 << USBRST) | (1 << ENUMDNEM) \
	| (1 << OEPINT) | (1 << IEPINT) | (1 << IISOIXFRM) | (1 << IPXFRM_DEVICE_MOD) \
	| (1 << WUIM));



	if(((matchedGlobalIntr >> OEPINT) & 1) == 1)
	{
		uint8_t epNum = 0;
		uint16_t matchedOutEpIntr = (*pOTG_FS_DAINT & *pOTG_FS_DAINTMSK) >> 16;
		while(matchedOutEpIntr)
		{
			uint16_t outEpIntr = readOutEpIntrStatus(epNum);
			if((outEpIntr >> XFRC) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 2;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}

							}
				(*pOTG_FS_DOEPINT(epNum) |= (1 << XFRC));
				epOutComplete(epNum);
			}
			if((outEpIntr >> EPDISD) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 3;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DOEPINT(epNum) |= (1 << EPDISD));
			}
			if((outEpIntr >> STUP) & 0x01)
			{

				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 4;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				
				//clear STUP interrupt bit
				(*pOTG_FS_DOEPINT(epNum) |= (1 << STUP));

				//extract the received packet
				extractSetupPacket(epReceivedData);
			}
			if((outEpIntr >> STSPHSRX) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 5;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DOEPINT(epNum) |= (1 << STSPHSRX));
			}
			if((outEpIntr >> NAK) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 6;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DOEPINT(epNum) |= (1 << NAK));
			}
			
			epNum ++;
			matchedOutEpIntr >>= 1;
		}

	}
	
	if(((matchedGlobalIntr >> IEPINT) & 0x01) == 1)
	{
		uint8_t epNum = 0;
		uint16_t matchedInEpIntr = ((*pOTG_FS_DAINT & *pOTG_FS_DAINTMSK) & 0xFFFFFF);
		while(matchedInEpIntr)
		{	
			uint16_t inEpIntr = readInEpIntrStatus(epNum);
			if((inEpIntr >> XFRC) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 7;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				//clear XFRC flag
				(*pOTG_FS_DIEPINT(epNum) |= (1 << XFRC));
				dataInStageCallback();
				//*pOTG_FS_DIEPEMPMSK &= ~(1 << 0); //this line for case: INEPTXFEM bit is enable when TXFE disable this bit but,
												  //this func enable it again
			}
			if((inEpIntr >> TOC) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 8;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DIEPINT(epNum) |= (1 << TOC));
			}
			if((inEpIntr >> EPDISD) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 9;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DIEPINT(epNum) |= (1 << EPDISD));
			}
		
			if((inEpIntr >> TXFE) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 10;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}

				//write to fifo
				writeEmpFifo((uint8_t**)(&Descriptor), xferInLen);//use "&" to udpate pos for next transfer (if yes)
			}
			
			epNum ++;
			matchedInEpIntr >>= 1;
		}

	}

	if(((matchedGlobalIntr >> USBSUSP) & 1) == 1)
	{
		//set status suspend (when program based register, we dont care?), stop USB PHY clock source (gate clock register)

		if(startStoreOder > 0)
					{
						checkOderRun[indexCheckOderRun] = 11;
						indexCheckOderRun ++;
						if(indexCheckOderRun >= LIMIT)
						{
							indexCheckOderRun = LIMIT_1;
						}
					}

		suspendCallback();

	}


#if 0
	if(((matchedGlobalIntr >> IISOIXFR) & 1) == 1)
	{
		if(indexCheckOderRun < 20)
		{
			checkOderRun[indexCheckOderRun] = 12;
			indexCheckOderRun ++;
		}
		*pOTG_FS_GINTSTS |= (1 << IISOIXFR);
	}
	if(((matchedGlobalIntr >> IPXFR_DEVICE_MOD) & 1) == 1)
	{
		if(indexCheckOderRun < 20)
		{
			checkOderRun[indexCheckOderRun] = 13;
			indexCheckOderRun ++;
		}
		*pOTG_FS_GINTSTS |= (1 << IPXFR_DEVICE_MOD);
	}
#endif //if0
	
	if(((matchedGlobalIntr >> WUI) & 1) == 1)
	{
		if(startStoreOder > 0)
					{
						checkOderRun[indexCheckOderRun] = 12;
						indexCheckOderRun ++;
						if(indexCheckOderRun >= LIMIT)
						{
							indexCheckOderRun = LIMIT_1;
						}
					}
		*pOTG_FS_GINTSTS |= (1 << WUI);
	}


	if(((matchedGlobalIntr >> USBRST) & 1) == 1)
	{
		//call reset USB function

		if(startStoreOder > 0)
					{
						checkOderRun[indexCheckOderRun] = 13;
						indexCheckOderRun ++;
						if(indexCheckOderRun >= LIMIT)
						{
							indexCheckOderRun = LIMIT_1;
						}
					}
		resetUSBSignal();

		//clear USB reset interrupt bit (write 1 to clear this bit)
		*pOTG_FS_GINTSTS |= (1 << USBRST);

